[A] FIN. add presentation
